system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-20 -8 -8)
    (5 -8 -8)
    (5 8 -8)
    (-20 8 -8)

    (-20 -8 0)
    (5 -8 0)
    (5 8 0)
    (-20 8 0)

    (-20 -8 2)
    (5 -8 2)
    (5 8 2)
    (-20 8 2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (101 65 100) simpleGrading (1 1 0.0625)
    hex (4 5 6 7 8 9 10 11) (101 65 50) simpleGrading (1 1 4)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    side
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
        );
    }
    midPlane
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
